#include <stdio.h>

int main()
{
    char Data[] = "이름:오리,국어:100점,수학:90점,영어:80점,이름:돼지,국어:90점,수학:80점,영어:70점,이름:너구리,국어:80점,수학:80점,영어:90점,이름:부어,국어:90점,수학:100점,영어:70점,이름:새,국어:100점,수학:80점,영어:100점,이름:야옹,국어:90점,수학:60점,영어:90점,이름:영양,국어:90점,수학:80점,영어:100점,이름:헤지호그,국어:90점,수학:100점,영어:70점,이름:염소,국어:50점,수학:80점,영어:90점,이름:비둘기,국어:90점,수학:80점,영어:100점";
    char *ptr = strstr(Data, "이름");
    char *met[10];
    int i = 0;
    while (ptr != NULL)
    {
        met[i] = ptr;
        ptr = strstr(NULL, "이름");
        i++;
    }
    for (i = 0; i < 10; i++)
        printf("%s\n", met[i]);
    return 0;
}